Ran Plan for project: `k8s` dir: `k8s` workspace: `filecoin-mainnet-apn1-glif-eks`

<details><summary>Show Output</summary>

```diff
Initializing modules...

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/tls from the dependency lock file
- Reusing previous version of hashicorp/local from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/random from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Using previously-installed hashicorp/helm v2.6.0
- Using previously-installed hashicorp/tls v4.0.2
- Using previously-installed hashicorp/local v2.2.3
- Using previously-installed hashicorp/aws v4.33.0
- Using previously-installed hashicorp/random v3.4.3
- Using previously-installed hashicorp/kubernetes v2.13.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Switched to workspace "filecoin-mainnet-apn1-glif-eks".


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.main must be replaced
+/- resource "aws_api_gateway_deployment" "main" {
      ~ created_date  = "2023-01-19T08:00:22Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ap-northeast-1:499623857295:ycy0w6a367/" -> (known after apply)
      ~ id            = "9gpyfd" -> (known after apply)
      ~ invoke_url    = "https://ycy0w6a367.execute-api.ap-northeast-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "a22574fb37476b792d775de7aff37bc3a9e7afb3" -> "d54f76f88e8ff0de42f7a95a26df804e18fed018"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_integration.statecirculatingsupply_fil_get will be updated in-place
~ resource "aws_api_gateway_integration" "statecirculatingsupply_fil_get" {
        id                      = "agi-ycy0w6a367-feo225-GET"
      ~ uri                     = "https://circulatingsupply-prod.s3.amazonaws.com/index.html" -> "https://circulatingsupply-prod.s3.amazonaws.com/index-verified.html"
        # (12 unchanged attributes hidden)
    }

  # aws_api_gateway_stage.calibration[0] will be updated in-place
~ resource "aws_api_gateway_stage" "calibration" {
      ~ deployment_id         = "9gpyfd" -> (known after apply)
        id                    = "ags-ycy0w6a367-calibration"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.hyperspace[0] will be updated in-place
~ resource "aws_api_gateway_stage" "hyperspace" {
      ~ deployment_id         = "9gpyfd" -> (known after apply)
        id                    = "ags-ycy0w6a367-hyperspace"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.mainnet[0] will be updated in-place
~ resource "aws_api_gateway_stage" "mainnet" {
      ~ deployment_id         = "9gpyfd" -> (known after apply)
        id                    = "ags-ycy0w6a367-mainnet"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.wallaby_node_glif_io[0] will be updated in-place
~ resource "aws_api_gateway_stage" "wallaby_node_glif_io" {
      ~ deployment_id         = "9gpyfd" -> (known after apply)
        id                    = "ags-ycy0w6a367-wallaby"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.kong_monitoring_plugin_external will be updated in-place
~ resource "kubernetes_manifest" "kong_monitoring_plugin_external" {
      ~ manifest = {
          - config     = {
              - bandwidth_metrics       = true
              - latency_metrics         = true
              - per_consumer            = true
              - status_code_metrics     = true
              - upstream_health_metrics = true
            } -> null
            # (4 unchanged elements hidden)
        }
      ~ object   = {
          ~ config      = {
              - bandwidth_metrics       = true
              - latency_metrics         = true
              - per_consumer            = true
              - status_code_metrics     = true
              - upstream_health_metrics = true
            } -> (known after apply)
            # (10 unchanged elements hidden)
        }
    }

  # module.ingress-kong_cid-checker-alternative-domain-wallaby[0].kubernetes_ingress_v1.ingress_kong will be created
+ resource "kubernetes_ingress_v1" "ingress_kong" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "cid.wallaby.filecoin.tools"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {

                          + service {
                              + name = "cid-checker-wallaby-frontend-service"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.ingress-kong_cid-checker-alternative-domain-wallaby[0].kubernetes_manifest.cors[0] will be created
+ resource "kubernetes_manifest" "cors" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = (known after apply)
              + namespace = "default"
            }
          + plugin     = "cors"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = (known after apply)
              + namespace                  = "default"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "cors"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.ingress-kong_cid-checker-alternative-domain-wallaby[0].random_string.rand will be created
+ resource "random_string" "rand" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_cid-checker-alternative-domain-wallaby-api[0].kubernetes_ingress_v1.ingress_kong will be created
+ resource "kubernetes_ingress_v1" "ingress_kong" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "cid.wallaby.filecoin.tools"

              + http {
                  + path {
                      + path      = "/api/(.*)"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "cid-checker-wallaby-backend-service"

                              + port {
                                  + number = 3000
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.ingress-kong_cid-checker-alternative-domain-wallaby-api[0].kubernetes_manifest.cors[0] will be created
+ resource "kubernetes_manifest" "cors" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = (known after apply)
              + namespace = "default"
            }
          + plugin     = "cors"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = (known after apply)
              + namespace                  = "default"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "cors"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.ingress-kong_cid-checker-alternative-domain-wallaby-api[0].random_string.rand will be created
+ resource "random_string" "rand" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_cid-checker-alternative-domain-wallaby-docs[0].kubernetes_ingress_v1.ingress_kong will be created
+ resource "kubernetes_ingress_v1" "ingress_kong" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "cid.wallaby.filecoin.tools"

              + http {
                  + path {
                      + path      = "/docs"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "cid-checker-wallaby-backend-service"

                              + port {
                                  + number = 3000
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.ingress-kong_cid-checker-alternative-domain-wallaby-docs[0].kubernetes_manifest.cors[0] will be created
+ resource "kubernetes_manifest" "cors" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = (known after apply)
              + namespace = "default"
            }
          + plugin     = "cors"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = (known after apply)
              + namespace                  = "default"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "cors"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.ingress-kong_cid-checker-alternative-domain-wallaby-docs[0].random_string.rand will be created
+ resource "random_string" "rand" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_cid-checker-alternative-domain-wallaby-docs-subresources[0].kubernetes_ingress_v1.ingress_kong will be created
+ resource "kubernetes_ingress_v1" "ingress_kong" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "cid.wallaby.filecoin.tools"

              + http {
                  + path {
                      + path      = "/docs/(.*)"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "cid-checker-wallaby-backend-service"

                              + port {
                                  + number = 3000
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.ingress-kong_cid-checker-alternative-domain-wallaby-docs-subresources[0].kubernetes_manifest.cors[0] will be created
+ resource "kubernetes_manifest" "cors" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = (known after apply)
              + namespace = "default"
            }
          + plugin     = "cors"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = (known after apply)
              + namespace                  = "default"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "cors"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.ingress-kong_cid-checker-alternative-domain-wallaby-docs-subresources[0].random_string.rand will be created
+ resource "random_string" "rand" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_cid-checker-wallaby[0].kubernetes_ingress_v1.ingress_kong will be created
+ resource "kubernetes_ingress_v1" "ingress_kong" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "wallaby.filecoin.tools"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {

                          + service {
                              + name = "cid-checker-wallaby-frontend-service"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.ingress-kong_cid-checker-wallaby[0].kubernetes_manifest.cors[0] will be created
+ resource "kubernetes_manifest" "cors" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = (known after apply)
              + namespace = "default"
            }
          + plugin     = "cors"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = (known after apply)
              + namespace                  = "default"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "cors"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.ingress-kong_cid-checker-wallaby[0].random_string.rand will be created
+ resource "random_string" "rand" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_cid-checker-wallaby-api[0].kubernetes_ingress_v1.ingress_kong will be created
+ resource "kubernetes_ingress_v1" "ingress_kong" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "wallaby.filecoin.tools"

              + http {
                  + path {
                      + path      = "/api/(.*)"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "cid-checker-wallaby-backend-service"

                              + port {
                                  + number = 3000
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.ingress-kong_cid-checker-wallaby-api[0].kubernetes_manifest.cors[0] will be created
+ resource "kubernetes_manifest" "cors" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = (known after apply)
              + namespace = "default"
            }
          + plugin     = "cors"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = (known after apply)
              + namespace                  = "default"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "cors"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.ingress-kong_cid-checker-wallaby-api[0].random_string.rand will be created
+ resource "random_string" "rand" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_cid-checker-wallaby-docs[0].kubernetes_ingress_v1.ingress_kong will be created
+ resource "kubernetes_ingress_v1" "ingress_kong" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "wallaby.filecoin.tools"

              + http {
                  + path {
                      + path      = "/docs"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "cid-checker-wallaby-backend-service"

                              + port {
                                  + number = 3000
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.ingress-kong_cid-checker-wallaby-docs[0].kubernetes_manifest.cors[0] will be created
+ resource "kubernetes_manifest" "cors" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = (known after apply)
              + namespace = "default"
            }
          + plugin     = "cors"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = (known after apply)
              + namespace                  = "default"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "cors"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.ingress-kong_cid-checker-wallaby-docs[0].random_string.rand will be created
+ resource "random_string" "rand" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_cid-checker-wallaby-docs-subresources[0].kubernetes_ingress_v1.ingress_kong will be created
+ resource "kubernetes_ingress_v1" "ingress_kong" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "wallaby.filecoin.tools"

              + http {
                  + path {
                      + path      = "/docs/(.*)"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "cid-checker-wallaby-backend-service"

                              + port {
                                  + number = 3000
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.ingress-kong_cid-checker-wallaby-docs-subresources[0].kubernetes_manifest.cors[0] will be created
+ resource "kubernetes_manifest" "cors" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = (known after apply)
              + namespace = "default"
            }
          + plugin     = "cors"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = (known after apply)
              + namespace                  = "default"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "cors"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.ingress-kong_cid-checker-wallaby-docs-subresources[0].random_string.rand will be created
+ resource "random_string" "rand" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_wallaby-archive[0].kubernetes_ingress_v1.ingress_kong will be created
+ resource "kubernetes_ingress_v1" "ingress_kong" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-internal-lb"

          + rule {
              + host = "mainnet-internal.node.glif.io"

              + http {
                  + path {
                      + path      = "/wallaby/lotus/(.*)"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "wallaby-archive-lotus-service"

                              + port {
                                  + number = 1234
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.ingress-kong_wallaby-archive[0].kubernetes_manifest.cors[0] will be created
+ resource "kubernetes_manifest" "cors" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = (known after apply)
              + namespace = "network"
            }
          + plugin     = "cors"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = (known after apply)
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "cors"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.ingress-kong_wallaby-archive[0].kubernetes_manifest.request_transformer_auth_header_replace_url[0] will be created
+ resource "kubernetes_manifest" "request_transformer_auth_header_replace_url" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + add     = {
                  + headers = [
                      + (sensitive),
                    ]
                }
              + replace = {
                  + uri = "/$(uri_captures[1])"
                }
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = (known after apply)
              + namespace = "network"
            }
          + plugin     = "request-transformer"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + add     = {
                  + headers = [
                      + "Authorization: Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJBbGxvdyI6WyJyZWFkIiwid3JpdGUiXX0.c5TXoiIyNb3xku1a_WIHHhxWpkP5F6Tp0CzXNKjjDr0",
                    ]
                }
              + replace = {
                  + uri = "/$(uri_captures[1])"
                }
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = (known after apply)
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "request-transformer"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.ingress-kong_wallaby-archive[0].random_string.rand will be created
+ resource "random_string" "rand" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_wallaby-dev-lotus-2346[0].kubernetes_ingress_v1.ingress_kong will be created
+ resource "kubernetes_ingress_v1" "ingress_kong" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "wss.wallaby.node.glif.io"

              + http {
                  + path {
                      + path      = "/apigw/lotus/(.*)"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "wallaby-archive-lotus-service"

                              + port {
                                  + number = 2346
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.ingress-kong_wallaby-dev-lotus-2346[0].kubernetes_manifest.cors[0] will be created
+ resource "kubernetes_manifest" "cors" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = (known after apply)
              + namespace = "network"
            }
          + plugin     = "cors"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = (known after apply)
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "cors"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.ingress-kong_wallaby-dev-lotus-2346[0].kubernetes_manifest.request_transformer_auth_header_replace_url[0] will be created
+ resource "kubernetes_manifest" "request_transformer_auth_header_replace_url" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + add     = {
                  + headers = [
                      + (sensitive),
                    ]
                }
              + replace = {
                  + uri = "/$(uri_captures[1])"
                }
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = (known after apply)
              + namespace = "network"
            }
          + plugin     = "request-transformer"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + add     = {
                  + headers = [
                      + "Authorization: Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJBbGxvdyI6WyJyZWFkIiwid3JpdGUiXX0.c5TXoiIyNb3xku1a_WIHHhxWpkP5F6Tp0CzXNKjjDr0",
                    ]
                }
              + replace = {
                  + uri = "/$(uri_captures[1])"
                }
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = (known after apply)
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "request-transformer"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.ingress-kong_wallaby-dev-lotus-2346[0].random_string.rand will be created
+ resource "random_string" "rand" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_wallaby_external[0].kubernetes_ingress_v1.ingress_kong will be created
+ resource "kubernetes_ingress_v1" "ingress_kong" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "wallaby.dev.node.glif.io"

              + http {
                  + path {
                      + path      = "/archive/lotus/(.*)"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "wallaby-archive-lotus-service"

                              + port {
                                  + number = 1234
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.ingress-kong_wallaby_external[0].kubernetes_manifest.cors[0] will be created
+ resource "kubernetes_manifest" "cors" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = (known after apply)
              + namespace = "network"
            }
          + plugin     = "cors"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + co
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.